{"format": "layers-model", "generatedBy": "keras v3.4.1", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "3.4.1", "model_config": {"class_name": "Model", "config": {"name": "efficientnetv2-b0", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_layer"}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "Rescaling", "config": {"name": "rescaling", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}}, "scale": 0.00392156862745098, "offset": 0.0}, "build_config": {"input_shape": [null, 128, 128, 3]}, "name": "rescaling", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128, 128, 3], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Normalization", "config": {"name": "normalization", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": [3], "invert": false, "mean": [0.485, 0.456, 0.406], "variance": [0.052441, 0.050176000000000005, 0.050625]}, "build_config": {"input_shape": [null, 128, 128, 3]}, "name": "normalization", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128, 128, 3], "dtype": "float32", "keras_history": ["rescaling", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "stem_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 128, 128, 3]}, "name": "stem_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128, 128, 3], "dtype": "float32", "keras_history": ["normalization", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 64, 64, 32]}, "name": "stem_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64, 64, 32], "dtype": "float32", "keras_history": ["stem_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "stem_activation", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "activation": "silu"}, "build_config": {"input_shape": [null, 64, 64, 32]}, "name": "stem_activation", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64, 64, 32], "dtype": "float32", "keras_history": ["stem_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block1a_project_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 64, 64, 32]}, "name": "block1a_project_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64, 64, 32], "dtype": "float32", "keras_history": ["stem_activation", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_project_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 64, 64, 16]}, "name": "block1a_project_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64, 64, 16], "dtype": "float32", "keras_history": ["block1a_project_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block1a_project_activation", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "activation": "silu"}, "build_config": {"input_shape": [null, 64, 64, 16]}, "name": "block1a_project_activation", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64, 64, 16], "dtype": "float32", "keras_history": ["block1a_project_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block2a_expand_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 64, 64, 16]}, "name": "block2a_expand_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64, 64, 16], "dtype": "float32", "keras_history": ["block1a_project_activation", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_expand_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 32, 32, 64]}, "name": "block2a_expand_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 64], "dtype": "float32", "keras_history": ["block2a_expand_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block2a_expand_activation", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "activation": "silu"}, "build_config": {"input_shape": [null, 32, 32, 64]}, "name": "block2a_expand_activation", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 64], "dtype": "float32", "keras_history": ["block2a_expand_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block2a_project_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 32, 32, 64]}, "name": "block2a_project_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 64], "dtype": "float32", "keras_history": ["block2a_expand_activation", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_project_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 32, 32, 32]}, "name": "block2a_project_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 32], "dtype": "float32", "keras_history": ["block2a_project_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Conv2D", "config": {"name": "block2b_expand_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 32, 32, 32]}, "name": "block2b_expand_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 32], "dtype": "float32", "keras_history": ["block2a_project_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_expand_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 32, 32, 128]}, "name": "block2b_expand_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["block2b_expand_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block2b_expand_activation", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "activation": "silu"}, "build_config": {"input_shape": [null, 32, 32, 128]}, "name": "block2b_expand_activation", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["block2b_expand_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block2b_project_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 32, 32, 128]}, "name": "block2b_project_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["block2b_expand_activation", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_project_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 32, 32, 32]}, "name": "block2b_project_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 32], "dtype": "float32", "keras_history": ["block2b_project_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Dropout", "config": {"name": "block2b_drop", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "rate": 0.01904761904761905, "seed": null, "noise_shape": [null, 1, 1, 1]}, "build_config": {"input_shape": [null, 32, 32, 32]}, "name": "block2b_drop", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 32], "dtype": "float32", "keras_history": ["block2b_project_bn", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "Add", "config": {"name": "block2b_add", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}}, "build_config": {"input_shape": [[null, 32, 32, 32], [null, 32, 32, 32]]}, "name": "block2b_add", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 32], "dtype": "float32", "keras_history": ["block2b_drop", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 32], "dtype": "float32", "keras_history": ["block2a_project_bn", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block3a_expand_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 32, 32, 32]}, "name": "block3a_expand_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 32], "dtype": "float32", "keras_history": ["block2b_add", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block3a_expand_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 16, 16, 128]}, "name": "block3a_expand_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 128], "dtype": "float32", "keras_history": ["block3a_expand_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block3a_expand_activation", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "activation": "silu"}, "build_config": {"input_shape": [null, 16, 16, 128]}, "name": "block3a_expand_activation", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 128], "dtype": "float32", "keras_history": ["block3a_expand_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block3a_project_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 16, 16, 128]}, "name": "block3a_project_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 128], "dtype": "float32", "keras_history": ["block3a_expand_activation", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block3a_project_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 16, 16, 48]}, "name": "block3a_project_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 48], "dtype": "float32", "keras_history": ["block3a_project_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Conv2D", "config": {"name": "block3b_expand_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 16, 16, 48]}, "name": "block3b_expand_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 48], "dtype": "float32", "keras_history": ["block3a_project_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block3b_expand_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 16, 16, 192]}, "name": "block3b_expand_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 192], "dtype": "float32", "keras_history": ["block3b_expand_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block3b_expand_activation", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "activation": "silu"}, "build_config": {"input_shape": [null, 16, 16, 192]}, "name": "block3b_expand_activation", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 192], "dtype": "float32", "keras_history": ["block3b_expand_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block3b_project_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 16, 16, 192]}, "name": "block3b_project_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 192], "dtype": "float32", "keras_history": ["block3b_expand_activation", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block3b_project_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 16, 16, 48]}, "name": "block3b_project_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 48], "dtype": "float32", "keras_history": ["block3b_project_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Dropout", "config": {"name": "block3b_drop", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "rate": 0.0380952380952381, "seed": null, "noise_shape": [null, 1, 1, 1]}, "build_config": {"input_shape": [null, 16, 16, 48]}, "name": "block3b_drop", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 48], "dtype": "float32", "keras_history": ["block3b_project_bn", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "Add", "config": {"name": "block3b_add", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}}, "build_config": {"input_shape": [[null, 16, 16, 48], [null, 16, 16, 48]]}, "name": "block3b_add", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 48], "dtype": "float32", "keras_history": ["block3b_drop", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 48], "dtype": "float32", "keras_history": ["block3a_project_bn", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block4a_expand_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 16, 16, 48]}, "name": "block4a_expand_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 48], "dtype": "float32", "keras_history": ["block3b_add", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block4a_expand_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 16, 16, 192]}, "name": "block4a_expand_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 192], "dtype": "float32", "keras_history": ["block4a_expand_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block4a_expand_activation", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "activation": "silu"}, "build_config": {"input_shape": [null, 16, 16, 192]}, "name": "block4a_expand_activation", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 192], "dtype": "float32", "keras_history": ["block4a_expand_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block4a_dwconv2", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 16, 16, 192]}, "name": "block4a_dwconv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 192], "dtype": "float32", "keras_history": ["block4a_expand_activation", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block4a_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 8, 8, 192]}, "name": "block4a_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 192], "dtype": "float32", "keras_history": ["block4a_dwconv2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block4a_activation", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "activation": "silu"}, "build_config": {"input_shape": [null, 8, 8, 192]}, "name": "block4a_activation", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 192], "dtype": "float32", "keras_history": ["block4a_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block4a_se_squeeze", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "data_format": "channels_last", "keepdims": false}, "build_config": {"input_shape": [null, 8, 8, 192]}, "name": "block4a_se_squeeze", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 192], "dtype": "float32", "keras_history": ["block4a_activation", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Reshape", "config": {"name": "block4a_se_reshape", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "target_shape": [1, 1, 192]}, "build_config": {"input_shape": [null, 192]}, "name": "block4a_se_reshape", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 192], "dtype": "float32", "keras_history": ["block4a_se_squeeze", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block4a_se_reduce", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 12, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "silu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 1, 1, 192]}, "name": "block4a_se_reduce", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 192], "dtype": "float32", "keras_history": ["block4a_se_reshape", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block4a_se_expand", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 1, 1, 12]}, "name": "block4a_se_expand", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 12], "dtype": "float32", "keras_history": ["block4a_se_reduce", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Multiply", "config": {"name": "block4a_se_excite", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}}, "build_config": {"input_shape": [[null, 8, 8, 192], [null, 1, 1, 192]]}, "name": "block4a_se_excite", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 192], "dtype": "float32", "keras_history": ["block4a_activation", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 192], "dtype": "float32", "keras_history": ["block4a_se_expand", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block4a_project_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 8, 8, 192]}, "name": "block4a_project_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 192], "dtype": "float32", "keras_history": ["block4a_se_excite", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block4a_project_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 8, 8, 96]}, "name": "block4a_project_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 96], "dtype": "float32", "keras_history": ["block4a_project_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Conv2D", "config": {"name": "block4b_expand_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 8, 8, 96]}, "name": "block4b_expand_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 96], "dtype": "float32", "keras_history": ["block4a_project_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block4b_expand_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 8, 8, 384]}, "name": "block4b_expand_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 384], "dtype": "float32", "keras_history": ["block4b_expand_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block4b_expand_activation", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "activation": "silu"}, "build_config": {"input_shape": [null, 8, 8, 384]}, "name": "block4b_expand_activation", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 384], "dtype": "float32", "keras_history": ["block4b_expand_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block4b_dwconv2", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 8, 8, 384]}, "name": "block4b_dwconv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 384], "dtype": "float32", "keras_history": ["block4b_expand_activation", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block4b_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 8, 8, 384]}, "name": "block4b_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 384], "dtype": "float32", "keras_history": ["block4b_dwconv2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block4b_activation", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "activation": "silu"}, "build_config": {"input_shape": [null, 8, 8, 384]}, "name": "block4b_activation", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 384], "dtype": "float32", "keras_history": ["block4b_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block4b_se_squeeze", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "data_format": "channels_last", "keepdims": false}, "build_config": {"input_shape": [null, 8, 8, 384]}, "name": "block4b_se_squeeze", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 384], "dtype": "float32", "keras_history": ["block4b_activation", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Reshape", "config": {"name": "block4b_se_reshape", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "target_shape": [1, 1, 384]}, "build_config": {"input_shape": [null, 384]}, "name": "block4b_se_reshape", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384], "dtype": "float32", "keras_history": ["block4b_se_squeeze", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block4b_se_reduce", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "silu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 1, 1, 384]}, "name": "block4b_se_reduce", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 384], "dtype": "float32", "keras_history": ["block4b_se_reshape", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block4b_se_expand", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 1, 1, 24]}, "name": "block4b_se_expand", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 24], "dtype": "float32", "keras_history": ["block4b_se_reduce", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Multiply", "config": {"name": "block4b_se_excite", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}}, "build_config": {"input_shape": [[null, 8, 8, 384], [null, 1, 1, 384]]}, "name": "block4b_se_excite", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 384], "dtype": "float32", "keras_history": ["block4b_activation", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 384], "dtype": "float32", "keras_history": ["block4b_se_expand", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block4b_project_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 8, 8, 384]}, "name": "block4b_project_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 384], "dtype": "float32", "keras_history": ["block4b_se_excite", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block4b_project_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 8, 8, 96]}, "name": "block4b_project_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 96], "dtype": "float32", "keras_history": ["block4b_project_conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Dropout", "config": {"name": "block4b_drop", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "rate": 0.05714285714285715, "seed": null, "noise_shape": [null, 1, 1, 1]}, "build_config": {"input_shape": [null, 8, 8, 96]}, "name": "block4b_drop", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 96], "dtype": "float32", "keras_history": ["block4b_project_bn", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "Add", "config": {"name": "block4b_add", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}}, "build_config": {"input_shape": [[null, 8, 8, 96], [null, 8, 8, 96]]}, "name": "block4b_add", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 96], "dtype": "float32", "keras_history": ["block4b_drop", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 96], "dtype": "float32", "keras_history": ["block4a_project_bn", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block4c_expand_conv", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 8, 8, 96]}, "name": "block4c_expand_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 96], "dtype": "float32", "keras_history": ["block4b_add", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block4c_expand_bn", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 132965955152160}, "axis": 3, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, 